# DeleteObjs

## Description
Procedure DeleteObjs deletes all selected objects on the active layer. Using this procedure when the layer display mode is Show/Snap/Modify will cause selected objects on any visible layer will be deleted.

```pascal
PROCEDURE DeleteObjs;
```

```python
def vs.DeleteObjs():
    return None
```

## Examples
lectandDelObjects}}

## Version
Availability: from All Versions

## Category
* Object Editing